<!DOCTYPE html>

<html lang="de">

<head>
<title>Geometrie-Zeichenprogramm</title>
<meta charset="utf-8">
<style>
body {font-family: sans-serif;}
h1 {font-size: 24px; font-weight: bold; text-align: center; background-color: #ffff00; border: 10px solid #0000ff; padding: 5px;}
ul {margin-top: 10px;}
li {margin-top: 8px;}
.klein {font-size: 10px;}
a {text-decoration: none; color: #0000ff; padding: 2px;}
a:hover, a:active {background-color: #ffc040; border: 2px solid #000000;}
#programm {margin: auto; background-color: #c0ff00; width: 400px; padding: 10px; border: 3px solid #0000ff; 
font-weight: bold; text-align: center;}
</style>
<meta name="description" content="Geometrie-Zeichenprogramm">
<meta name="keywords" content="Geometrie, Zeichenprogramm">
</head>

<body>

<h1>Geometrie-Zeichenprogramm</h1>

<h2>&Uuml;bersicht</h2>

<ul>
<li><a href="#zweck">Zweck des Programms</a></li>
<li><a href="#system">Systemvoraussetzungen</a></li>
<li><a href="#hinweise">Hinweise zur Bedienung</a></li>
<li><a href="#grenzen">Einschr&auml;nkungen</a></li>
<li><a href="#download">Herunterladen des Programms</a></li>
</ul>

<h2 id="zweck">Zweck des Programms</h2>

<p>Dieses Programm erm&ouml;glicht die Erstellung von geometrischen Zeichnungen und das Plotten von Funktionsgraphen am Computer. 
Zus&auml;tzlich sind in den Zeichnungen einfache Messungen (etwa von Abst&auml;nden oder Winkelgr&ouml;&szlig;en) und Berechnungen 
(zum Beispiel von bestimmten Integralen) m&ouml;glich. Das Programm hat keinen Zugmodus und ist nicht 
als Alternative zu dynamischen Geometrie-Programmen wie <a href="http://www.geogebra.org/" target="_blank">Geogebra</a> 
(Markus Hohenwarter), <a href="http://geonext.uni-bayreuth.de" target="_blank">GeoNext</a> (Universit&auml;t Bayreuth) 
oder <a href="http://zul.rene-grothmann.de/doc_de/index.html" target="_blank">Zirkel und Lineal</a> (Dr. Ren&eacute; Grothmann) 
zu verstehen, sondern lediglich als Zeichenwerkzeug. 

<h2 id="system">Systemvoraussetzungen</h2>

<p>Das Programm l&auml;uft &#8211; jedenfalls prinzipiell &#8211; auf allen g&auml;ngigen Plattformen (Windows, Linux, Macintosh). 
Voraussetzung ist die Installation einer aktuellen Java-Laufzeitumgebung (mindestens Java 7), bezeichnet als JRE 
(Java Runtime Environment) oder VM (Virtual Machine). Diese kann bei 
<a href="http://www.java.com/de/download/" target="_blank">Oracle</a> heruntergeladen werden.</p>

<h2 id="hinweise">Hinweise zur Bedienung</h2>

<p>Im Men&uuml; &quot;Einstellungen&quot; l&auml;sst sich festlegen, welcher Bereich der Zeichenebene gezeichnet werden soll 
und ob das Koordinatensystem sichtbar sein soll. Des Weiteren kann man vorgeben, wie Punkte oder Linien dargestellt werden sollen.</p>

<p>Das Men&uuml; &quot;Eingabe&quot; dient der Erweiterung der Zeichnung. In vielen F&auml;llen m&uuml;ssen schon vorhandene Objekte 
der Zeichnung mit der Maus angeklickt werden. Die Anweisungen dazu befinden sich in der Statuszeile (unten, in roter Farbe).</p>

<p>&Uuml;ber das Men&uuml; &quot;Daten&quot; lassen sich Angaben zu den Bestandteilen der Zeichnung abrufen und &auml;ndern. 
Mit Hilfe eines Buttons kann man das gerade ausgew&auml;hlte Objekt l&ouml;schen.</p>

<h2 id="grenzen">Einschr&auml;nkungen</h2>

<p>Wie die Versionsnummer andeutet, handelt es sich bei diesem Programm um eine Testversion, die noch einige Unzul&auml;nglichkeiten 
und m&ouml;glicherweise auch noch grobe Fehler enth&auml;lt.</p>

<h2 id="download">Herunterladen des Programms</h2>

<p>Die Nutzung f&uuml;r private Zwecke unterliegt keinen Einschr&auml;nkungen. Die Weitergabe des Programms ist nur erlaubt, 
wenn kein Geld daf&uuml;r verlangt wird und alle Dateien unver&auml;ndert bleiben. Dies gilt insbesondere f&uuml;r die 
Copyright-Vermerke und die angegebene URL.</p>

<div id="programm"><a href="g2d.jar" target="_blank">www.walter-fendt.de/download/g2d.jar</a></div>

<p class="klein">URL: https://www.walter-fendt.de/download/g2d.htm<br>
Walter Fendt, 12. Dezember 2019</p>

</body>
</html>
